; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v2 - type_2 ?v4 - type_1)
 	      (pred_4 ?v8 - object ?v4 - type_1)
	      (pred_1 ?v2 - type_2 ?v1 - type_3)
	      (pred_3 ?v2 - type_2 ?v8 - object ?v1 - type_3))

   (:action op_3
       :parameters  (?v2 - type_2 ?v7 ?v5 - type_1)
       :precondition (and  (pred_2 ?v2 ?v7))
       :effect (and  (pred_2 ?v2 ?v5)
		     (not (pred_2 ?v2 ?v7))))

   (:action op_2
       :parameters (?v2 - type_2 ?v6 - object ?v3 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_4 ?v6 ?v3) (pred_2 ?v2 ?v3) (pred_1 ?v2 ?v1))
       :effect (and (pred_3 ?v2 ?v6 ?v1)
		    (not (pred_4 ?v6 ?v3)) 
		    (not (pred_1 ?v2 ?v1))))

   (:action op_1
       :parameters (?v2 - type_2 ?v6 - object ?v3 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_3 ?v2 ?v6 ?v1) (pred_2 ?v2 ?v3))
       :effect (and (pred_4 ?v6 ?v3)
		    (pred_1 ?v2 ?v1)
		    (not (pred_3 ?v2 ?v6 ?v1)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_05 - type_2
obj_06 obj_02 - type_3
obj_09 obj_07 obj_01 - type_1
obj_08 obj_04 obj_03 - object)
(:init
(pred_2 obj_05 obj_09)
(pred_1 obj_05 obj_06)
(pred_1 obj_05 obj_02)
(pred_4 obj_08 obj_09)
(pred_4 obj_04 obj_01)
(pred_4 obj_03 obj_07)
)
(:goal
(and
(pred_4 obj_08 obj_01)
(pred_4 obj_04 obj_09)
(pred_4 obj_03 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_05 ?b obj_02))))
)
)

; plan
1. (op_2 obj_05 obj_08 obj_09 obj_06)
   deleted: (pred_4 obj_08 obj_09) (pred_1 obj_05 obj_06)
   added: (pred_3 obj_05 obj_08 obj_06)
   goals met: 1 of 3
2. (op_3 obj_05 obj_09 obj_01)
   deleted: (pred_2 obj_05 obj_09)
   added: (pred_2 obj_05 obj_01)
   goals met: 1 of 3
3. (op_1 obj_05 obj_08 obj_01 obj_06)
   deleted: (pred_3 obj_05 obj_08 obj_06)
   added: (pred_4 obj_08 obj_01) (pred_1 obj_05 obj_06)
   goals met: 2 of 3
4. (op_2 obj_05 obj_04 obj_01 obj_06)
   deleted: (pred_4 obj_04 obj_01) (pred_1 obj_05 obj_06)
   added: (pred_3 obj_05 obj_04 obj_06)
   goals met: 2 of 3
5. (op_3 obj_05 obj_01 obj_09)
   deleted: (pred_2 obj_05 obj_01)
   added: (pred_2 obj_05 obj_09)
   goals met: 2 of 3
6. (op_1 obj_05 obj_04 obj_09 obj_06)
   deleted: (pred_3 obj_05 obj_04 obj_06)
   added: (pred_4 obj_04 obj_09) (pred_1 obj_05 obj_06)
   goals met: 3 of 3
